var previousRandomNumber = -1; // Initialize with a value that can't be a valid index

function change() {
    var cite = [
        { qoute:"“اللهم اجعلني خيرًا مما يظنون، واستر على ما لا يعلمون، واغفر لي يوم لا ينفع مال ولا بنون إلا من أتاك بقلب سليم، فارزقني اللهم قلبًا سليمًا أتيك به يوم القيامة.”" },
        { qoute:"“كل أنواع الإدمان جذورها هروب من صراع نفسي، فعالج صراعك تعالج إدمانك.”" },
        { qoute:"“كل شخص على هذا الكوكب لديه قصة؛ لذا لا تحكم على الناس قبل أن تعرفهم حقًّا؛ فالحقيقة قد تكون مفاجأة لك.”" },
        { qoute:"“كُل شعور مبنيّ على فكرة، غيّر الفكرة يتغيّر الشعور”" },
        { qoute:"“مَن كَثُر عِلمُه قَلَّ إنكَارُه على الناس”" },
        { qoute:"“فكما قالوا: العبادة بغياب النية تصبح عادة والعادة بحضور النية تصبح عبادة”" },
        { qoute:"“المعاناه هي المسافة بين الواقع وبين ما تريد، ولتقضي على المعاناة: غير الواقع أو غير ما تريد”" ,},
        { qoute:"“إن سعر ضبط النفس دائما أرخص من سعر الندم”" },
        { qoute:"“قصة حياتك تؤلفها عاداتك، غيّر عاداتك لتُغَيِّر القصة.”" },
        { qoute:"“ لا تنافس الناس نافس نفسك ليكون يومك أفضل من أمسك”" },
        { qoute:"“بين الفعل ورد الفعل مسافه تكون فيها شخصيتك”" },
        { qoute:"“طوبى لمن مات وماتت معه ذنوبه وويل لمن مات وعاشت بعده ذنوبه”" },
        { qoute:"“ إذا لم تستطع فعل شيء عظيم، فافعل شيئاً بسيطاً بطريقة عظيمة”" },
        { qoute:"الله لا يريد منا الكمال ولكن يريد السعي المستمر نحوه”" },
        { qoute:"“  اقتل الملل بإحياء أهداف جديدة في حياتك”" },
        { qoute:"“الكون كله مترابط، ونيتك وما في داخل قلبك يحركان الكون إما لك وإما عليك”" },
        { qoute:"“ لكي يدخل كلامك عقل من أمامك اجعله يفرغ ما فيه أولاً حتى يكون هناك مكان لكلامك ليدخل فيه، وإلا فكيف يُملأ مملوء؟ ”" },
                ]
                do {
                    count = Math.floor(Math.random() * cite.length);
                } while (count === previousRandomNumber); // Repeat until a different random number is generated
            
                previousRandomNumber = count; // Update the previous random number
            
                document.getElementById("Quote").innerHTML = cite[count].qoute;

}
window.onload=change